ttm/templatecase/constant/battery_template/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

"battery0_0_to_airInside"
{
    type        opaqueDiffusive;

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.15 0.15);
        emissivity      (0.15 0.15);
    };
}
".*"
{
    type        opaqueDiffusive;

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.15 0.15);
        emissivity      (0.15 0.15);
    };
}
// ************************************************************************* //
